app/views/articles/_comment.html.erb

SELECT "comments".* FROM "comments" WHERE "comments"."article_id" = ?  [["article_id", 33]]
---

      <% @article.comments.each do |comment| %>