app/controllers/articles_controller.rb

	def create
	  @article = Article.new(article_params)

	  if @article.save
	  	@articles = Article.all
---
INSERT INTO "articles" ("author", "created_at", "text", "updated_at") VALUES (?, ?, ?, ?)  [["author", "tere"], ["created_at", Tue, 29 Apr 2014 02:32:11 UTC +00:00], ["text", "lkdjfkdjf"], ["updated_at", Tue, 29 Apr 2014 02:32:11 UTC +00:00]]
SELECT "articles".* FROM "articles"

	def destroy
		@article = Article.find(params[:id])
		if @article.destroy
---
SELECT "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT 1  [["id", "1"]]
DELETE FROM "articles" WHERE "articles"."id" = ?  [["id", 1]]

	def sweet
		@article = Article.find_by(id: params[:id])

	    if @article
	      @article.sweet = @article.sweet.to_i + 1
	      if @article.save
---
SELECT "articles".* FROM "articles" WHERE "articles"."id" = 33 LIMIT 1
UPDATE "articles" SET "sweet" = ?, "updated_at" = ? WHERE "articles"."id" = 33  [["sweet", 1], ["updated_at", Wed, 30 Apr 2014 02:48:14 UTC +00:00]]

	def sour
		@article = Article.find_by(id: params[:id])

	    if @article
	      @article.sour = @article.sour.to_i + 1
	      if @article.save
---
SELECT "articles".* FROM "articles" WHERE "articles"."id" = 33 LIMIT 1
UPDATE "articles" SET "sour" = ?, "updated_at" = ? WHERE "articles"."id" = 33  [["sour", 1], ["updated_at", Wed, 30 Apr 2014 02:48:15 UTC +00:00]]